# В модуль с проверкой даты добавьте возможность запуска в терминале с передачей даты на проверку.

# Добавьте в пакет, созданный на семинаре шахматный модуль. Внутри него напишите код, решающий задачу о 8 ферзях. 
# Известно, что на доске 8×8 можно расставить 8 ферзей так, чтобы они не били друг друга. 
# Вам дана расстановка 8 ферзей на доске, определите, есть ли среди них пара бьющих друг друга. 
# Программа получает на вход восемь пар чисел, каждое число от 1 до 8 - координаты 8 ферзей. 
# Если ферзи не бьют друг друга верните истину, а если бьют - ложь.

# Напишите функцию в шахматный модуль. Используйте генератор случайных чисел для случайной 
# расстановки ферзей в задаче выше. Проверяйте различный случайные  варианты и выведите 4 успешных расстановки.

import datetime
from sys import argv

def check_date(date: str) -> bool:
    format = '%d.%m.%Y'
    try:
        date = datetime.datetime.strptime(date, format)
        print(date)
        return True
    except:
        return False

print(check_date(argv[1]))

# python HW6.py 29.02.2000