# Создайте несколько переменных разных типов. Проверьте к какому типу относятся созданные переменные. 


a = 42
b = 73.0
c = 'Hello world!'
d = (a, b, c)
print(f'Объект {a} имеет тип {type(a)}')
print(f'Объект {b} имеет тип {type(b)}')
print(f'Объект {c} имеет тип {type(c)}')
print(f'Объект {d} имеет тип {type(d)}')
